Revit 2027 API
ExternalServiceOptions.IsPublic Property
 This property denotes a service as either public or private.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPublic { get; set; }
Public Property IsPublic As Boolean
	Get
	Set
public:
property bool IsPublic {
	bool get ();
	void set (bool value);
}
member IsPublic : bool with get, set
Property Value
Boolean
Remarks
A public service can be executed by anyone, while a private service can be execute only by the caller who registered it (the owner of the service, typically), or by someone who has access to the service's execution key.
Unless specified otherwise, all services are created as private by default.
See Also
Reference
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace